beverage_structure = {

    "탄산/청량음료": {
        "플레이버": [
            "콜라", "제로콜라", "라임", "자몽", "청포도",
            "유자", "복숭아", "파인애플", "망고",
            "딸기", "레몬", "체리", "에너지콜라"
        ],
        "브랜드": [
            "코카콜라", "코카콜라제로", "펩시", "펩시제로",
            "칠성사이다", "환타", "스프라이트", "탐스"
        ]
    },

    "과일주스/NFC": {
        "플레이버": [
            "오렌지", "망고", "사과", "포도", "자몽",
            "파인애플", "타트체리", "블루베리",
            "아로니아", "레몬", "복숭아", "석류"
        ],
        "브랜드": [
            "델몬트", "썬키스트", "따옴", "돈시몬",
            "웅진", "코카콜라미닛메이드"
        ]
    },

    "건강기능성/프로틴": {
        "플레이버": [
            "초코", "바닐라", "쿠키앤크림",
            "베리믹스", "망고프로틴", "그린티",
            "흑임자", "콜라겐레몬"
        ],
        "브랜드": [
            "마이밀", "셀시어스", "닥터유", "몬스터",
            "레드불", "하이뮨"
        ]
    },

    "차/전통음료": {
        "플레이버": [
            "녹차", "홍차", "보리차", "옥수수차",
            "헛개차", "식혜", "쌍화차", "대추차"
        ],
        "브랜드": [
            "광동", "동서", "웅진", "담터"
        ]
    },

    "제로/저당": {
        "플레이버": [
            "제로콜라", "제로사이다",
            "무가당레몬", "저당망고",
            "무설탕자몽"
        ],
        "브랜드": [
            "코카콜라제로", "펩시제로",
            "칠성제로", "탐스제로"
        ]
    }
}
